In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
index  = [1,2,3] 
names=['Hajar','Sarah','Ghadi']
s1 = pd.Series(names, index=index)
s1

1    Hajar
2    Sarah
3    Ghadi
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [5]:
s1.index = [11, 12, 13]
s1

11    Hajar
12    Sarah
13    Ghadi
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
s1[:2]

11    Hajar
12    Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [7]:
s1 = pd.concat([s1 , pd.Series(['Hajar'], [14])])
s1

11    Hajar
12    Sarah
13    Ghadi
14    Hajar
dtype: object

In [9]:
s1.drop_duplicates()

11    Hajar
12    Sarah
13    Ghadi
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [15]:
Data = {
    'ID': ['4418'],
    'Name': ['Hajar Alamer'],
    'GPA':['5']
}

Studentdf = pd.DataFrame(Data, columns=['ID', 'Name','GPA']) 
Studentdf

     ID          Name GPA
0  4418  Hajar Alamer   5

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [16]:
data_From_CSV = pd.read_csv('educ_figdp_1_Data.csv')
data_From_CSV

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [19]:
data_From_CSV.keys()

Index(['TIME', 'GEO', 'INDIC_ED', 'Value', 'Flag and Footnotes'], dtype='object')

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [22]:
# loc uses index labels as references
data_From_CSV.loc[2:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [21]:
data_From_CSV.loc[2:3, ['GEO', 'Value']]# loc with specific columns

                             GEO Value
2  European Union (28 countries)  5.00
3  European Union (28 countries)  5.03

In [28]:
#  while slicing uses positions excluding the end index
data_From_CSV[2:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [29]:
data_From_CSV[['GEO', 'Value']]

                               GEO Value
0    European Union (28 countries)     :
1    European Union (28 countries)     :
2    European Union (28 countries)  5.00
3    European Union (28 countries)  5.03
4    European Union (28 countries)  4.95
..                             ...   ...
379                        Finland  5.90
380                        Finland  6.10
381                        Finland  6.81
382                        Finland  6.85
383                        Finland  6.76

[384 rows x 2 columns]